In [1]:
import pandas as pd
india_weather = pd.DataFrame({
    "city" : ['mumbai','delhi','banglore'],
    "temperature" : [32,45,30],
    "humidity" : [80,60,78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [2]:
US_weather = pd.DataFrame({
    "city" : ['new york','chicago','orlando'],
    "temperature" : [21,14,35],
    "humidity" : [68,65,75]
})
US_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [4]:
df = pd.concat([india_weather,US_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [5]:
df = pd.concat([india_weather,US_weather],ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [6]:
df = pd.concat([india_weather,US_weather],keys=["INDIA","US"])
df

             city  temperature  humidity
INDIA 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
US    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [7]:
df.loc["INDIA"]

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [8]:
df.loc["US"]

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [11]:
temperature_df =pd.DataFrame({
    "city":['mumbai','delhi','banglore'],
    "temperature":[32,45,30]
})
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [12]:
windspeed_df =pd.DataFrame({
    "city":['mumbai','delhi','banglore'],
    "windspeed":[7,12,9]
})
windspeed_df

       city  windspeed
0    mumbai          7
1     delhi         12
2  banglore          9

In [13]:
df = pd.concat([temperature_df,windspeed_df])
df

       city  temperature  windspeed
0    mumbai         32.0        NaN
1     delhi         45.0        NaN
2  banglore         30.0        NaN
0    mumbai          NaN        7.0
1     delhi          NaN       12.0
2  banglore          NaN        9.0

In [14]:
df = pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temperature      city  windspeed
0    mumbai           32    mumbai          7
1     delhi           45     delhi         12
2  banglore           30  banglore          9

In [16]:
 temperature_df =pd.DataFrame({
    "city":['mumbai','delhi','banglore'],
    "temperature":[32,45,30]
},index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [17]:
windspeed_df =pd.DataFrame({
    "city":['delhi','mumbai'],
    "windspeed":[7,12]
}, index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [18]:
df = pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN

In [19]:
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [22]:
s=pd.Series(['Humid','Dry','Rain'],name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [24]:
df=pd.concat([temperature_df,s],axis=1)
df

       city  temperature  event
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           30   Rain